example_xml/get_consultant_name_constraint.xml

<?xml version="1.0" encoding="utf-8"?>
<soapenv:Envelope 
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" 
    xmlns:xsd="http://www.w3.org/2001/XMLSchema" 
    xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" 
    xmlns:axis="http://axis2.ws.jasperserver.jaspersoft.com">
  <soapenv:Body>
    <axis:get soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
      <requestXmlString xsi:type="xsd:string">
      <![CDATA[
        <request operationName="get" locale="en">
            <argument name="IC_GET_QUERY_DATA">true</argument>
            <resourceDescriptor name="JRLogo" wsType="inputControl" uriString="/reports/xforty/consultant_name" isNew="false">
            </resourceDescriptor>
        </request>
        ]]>
      </requestXmlString>
     </axis:get>
  </soapenv:Body>
</soapenv:Envelope>
