example_xml/list.xml

<?xml version="1.0" encoding="utf-8"?>
<soapenv:Envelope 
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" 
    xmlns:xsd="http://www.w3.org/2001/XMLSchema" 
    xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" 
    xmlns:axis="http://axis2.ws.jasperserver.jaspersoft.com">
  <soapenv:Body>
    <axis:list soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
      <requestXmlString xsi:type="xsd:string">
      <![CDATA[
         <request operationName="list"> 
           <argument name="LIST_RESOURCES"/> 
           <argument name="RESOURCE_TYPE">reportUnit</argument> 
           <argument name="START_FROM_DIRECTORY">/Reports/xforty</argument> 
        </request>
        ]]>
      </requestXmlString>
     </axis:list>
  </soapenv:Body>
</soapenv:Envelope>
